
## Plan Result (prod)




<pre><code>Plan: 20 to add, 19 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_log_analytics_workspace.quarantine-analytics[0]
  * azurerm_managed_disk.shared_disk
  * azurerm_storage_blob.quarantine-st[0]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsassess&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsassure&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig01&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig02&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig03&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig04&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig05&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsoracle&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsunstr&#34;]
  * module.sa-migration-quarantine[0].azapi_update_resource.defender_settings
  * module.sa-migration-quarantine[0].azurerm_private_endpoint.this[0]
  * module.sa-migration-quarantine[0].azurerm_storage_account.storage_account
  * module.sa-migration-quarantine[0].azurerm_storage_container.container[&#34;darts-quarantine&#34;]
  * module.sa-migration-quarantine[0].random_string.storage_account_random_string
  * module.sa-migration-quarantine[0].time_rotating.rotate
  * module.sa-migration-quarantine[0].time_static.pim_expiry
  * module.sa-migration-quarantine[0].time_static.pim_start
* Update
  * azurerm_linux_virtual_machine.dock-linux[&#34;prddartsmigdock&#34;]
  * azurerm_linux_virtual_machine.gitlab-linux[&#34;prddartsgitlab&#34;]
  * azurerm_linux_virtual_machine.migration[0]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdb01&#34;]
  * azurerm_linux_virtual_machine.migration-linux2[&#34;prddartsmigdb02&#34;]
  * azurerm_linux_virtual_machine.oracle[&#34;prddartsmigora01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassess&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassure&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig05&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsoracle&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsunstr&#34;]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
  * module.sa_dets[0].azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.dock-linux["prddartsmigdock"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "dock-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock"
        name                                                   = "prddartsmigdock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.gitlab-linux["prddartsgitlab"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "gitlab-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsgitlab"
        name                                                   = "prddartsgitlab"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                                                   = "migration-vm"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdb01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb01"
        name                                                   = "prddartsmigdb01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux2["prddartsmigdb02"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux2" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb02"
        name                                                   = "prddartsmigdb02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.oracle["prddartsmigora01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "oracle" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigora01"
        name                                                   = "prddartsmigora01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_log_analytics_workspace.quarantine-analytics[0] will be created
  + resource "azurerm_log_analytics_workspace" "quarantine-analytics" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "darts-quarantine-analytics-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "darts-migration-prod-rg"
      + retention_in_days               = 730
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_managed_disk.shared_disk will be created
  + resource "azurerm_managed_disk" "shared_disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 30000
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = 9
      + name                              = "shared-disk"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tier                              = (known after apply)
    }

  # azurerm_storage_blob.quarantine-st[0] will be created
  + resource "azurerm_storage_blob" "quarantine-st" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "darts-quarantine-blob-st-prod"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = "saproddartsquarantine"
      + storage_container_name = "darts-migration"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsassess"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsassess-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsassure"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsassure-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsmig01"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig01-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsmig02"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig02-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsmig03"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig03-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsmig04"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig04-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsmig05"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig05-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsoracle"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsoracle-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsoracle"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.vm1_attachment["prddartsunstr"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "vm1_attachment" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsunstr-datadisk"
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsunstr"
      + write_accelerator_enabled = false
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassess"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
        name                                                   = "prddartsassess"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassure"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
        name                                                   = "prddartsassure"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig01"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
        name                                                   = "prddartsmig01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig02"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02"
        name                                                   = "prddartsmig02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig03"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03"
        name                                                   = "prddartsmig03"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig04"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04"
        name                                                   = "prddartsmig04"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig05"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05"
        name                                                   = "prddartsmig05"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsoracle"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsoracle"
        name                                                   = "prddartsoracle"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsunstr"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsunstr"
        name                                                   = "prddartsunstr"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.darts_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Cache/redis/darts-prod"
        name                               = "darts-prod"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
            # (16 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod"
        name                               = "dartssaprod"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-migration-quarantine[0].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = true
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = 250000
                      + isEnabled     = true
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = true
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa-migration-quarantine[0].azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "saproddartsquarantine"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "darts-migration-prod-rg"
      + subnet_id                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet"
      + tags                     = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "saproddartsquarantine"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.sa-migration-quarantine[0].azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "saproddartsquarantine"
      + nfsv3_enabled                      = true
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "darts-migration-prod-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 365
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.sa-migration-quarantine[0].azurerm_storage_container.container["darts-quarantine"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "darts-quarantine"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "saproddartsquarantine"
    }

  # module.sa-migration-quarantine[0].random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.sa-migration-quarantine[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-migration-quarantine[0].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa-migration-quarantine[0].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02"
        name                               = "saproddartsmig02"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_dets[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsartefacts"
        name                               = "saproddartsartefacts"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 20 to add, 19 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":328,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->